Revit.Elements.Mullion
A Revit Mullion

Revit.Elements.Mullion.#ctor(Autodesk.Revit.DB.Mullion)
Create from an existing Revit Element
mullionElement:

Revit.Elements.Mullion.InitMullion(Autodesk.Revit.DB.Mullion)
Initialize a Mullion element
mullionElement:

Revit.Elements.Mullion.ByElement(Revit.Elements.Mullion)
get curtain panel from element
mullionElement:

Revit.Elements.Mullion.ByElement(Revit.Elements.Element)
get all mullions of curtain wall, system or slope galzing roof
hostingElement:

Revit.Elements.Mullion.FromExisting(Autodesk.Revit.DB.Mullion,System.Boolean)
Construct this type from an existing Revit element.
mullion:
isRevitOwned:
Returns:

Revit.Elements.Mullion.SupportedPanels
Returns curtain panels supported by the specified Mullion Element
Returns:

Revit.Elements.Mullion.AsFamilyInstance
Returns FamilyInstance object as represented by the specified mullion
Returns:

Revit.Elements.Mullion.LocationCurve
Gets curve geometry from the specified Mullion Element